# ForwardIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalApplicationArray..::..ForwardIterator Method
ExternalApplicationArray Class See Also
---
Retrieve a forward moving iterator to the array.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual ExternalApplicationArrayIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As ExternalApplicationArrayIterator
```

Visual C++
---
```text
public:
virtual ExternalApplicationArrayIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the array.
# See Also
ExternalApplicationArray Class
Autodesk.Revit.UI Namespace